## stage plan
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols: + create - destroy -/+ destroy and then create replacement Terraform will perform the following actions: # aws_s3_bucket.dontdelete will be destroyed - resource "aws_s3_bucket" "dontdelete" { - arn = "arn:aws:s3:::pleasedontdeleteme-2983472938479283" -> null - bucket = "pleasedontdeleteme-2983472938479283" -> null - bucket_domain_name = "pleasedontdeleteme-2983472938479283.s3.amazonaws.com" -> null - bucket_regional_domain_name = "pleasedontdeleteme-2983472938479283.s3.amazonaws.com" -> null - hosted_zone_id = "Z3AQBSTGFYJSTF" -> null - id = "pleasedontdeleteme-2983472938479283" -> null - region = "us-east-1" -> null - request_payer = "BucketOwner" -> null - tags = {} -> null - tags_all = {} -> null - versioning { - enabled = false -> null - mfa_delete = false -> null } } # module.some_ec2_service.aws_instance.this must be replaced -/+ resource "aws_instance" "this" { ~ arn = "arn:aws:ec2:us-east-1:335168714028:instance/i-019b9be1b37b39df4" -> (known after apply) ~ associate_public_ip_address = true -> (known after apply) ~ availability_zone = "us-east-1a" -> (known after apply) ~ cpu_core_count = 1 -> (known after apply) ~ cpu_threads_per_core = 2 -> (known after apply) ~ disable_api_termination = false -> (known after apply) ~ ebs_optimized = false -> (known after apply) - hibernation = false -> null + host_id = (known after apply) ~ id = "i-019b9be1b37b39df4" -> (known after apply) ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply) ~ instance_state = "running" -> (known after apply) ~ ipv6_address_count = 0 -> (known after apply) ~ ipv6_addresses = [] -> (known after apply) + key_name = (known after apply) ~ monitoring = false -> (known after apply) + outpost_arn = (known after apply) + password_data = (known after apply) + placement_group = (known after apply) ~ primary_network_interface_id = "eni-0d082a333eb3f704e" -> (known after apply) ~ private_dns = "ip-172-31-64-80.ec2.internal" -> (known after apply) ~ private_ip = "172.31.64.80" -> (known after apply) ~ public_dns = "ec2-3-237-64-168.compute-1.amazonaws.com" -> (known after apply) ~ public_ip = "3.237.64.168" -> (known after apply) ~ secondary_private_ips = [] -> (known after apply) ~ security_groups = [ # forces replacement + "allow-nothing", - "default", ] ~ subnet_id = "subnet-d929a2bc" -> (known after apply) tags = { "Application" = "some-ec2-service" "Name" = "stage-some-ec2-service" } ~ tenancy = "default" -> (known after apply) + user_data = (known after apply) + user_data_base64 = (known after apply) ~ vpc_security_group_ids = [ - "sg-ff42769b", ] -> (known after apply) # (5 unchanged attributes hidden) ~ capacity_reservation_specification { ~ capacity_reservation_preference = "open" -> (known after apply) + capacity_reservation_target { + capacity_reservation_id = (known after apply) } } - credit_specification { - cpu_credits = "unlimited" -> null } + ebs_block_device { + delete_on_termination = (known after apply) + device_name = (known after apply) + encrypted = (known after apply) + iops = (known after apply) + kms_key_id = (known after apply) + snapshot_id = (known after apply) + tags = (known after apply) + throughput = (known after apply) + volume_id = (known after apply) + volume_size = (known after apply) + volume_type = (known after apply) } ~ enclave_options { ~ enabled = false -> (known after apply) } + ephemeral_block_device { + device_name = (known after apply) + no_device = (known after apply) + virtual_name = (known after apply) } ~ metadata_options { ~ http_endpoint = "enabled" -> (known after apply) ~ http_put_response_hop_limit = 1 -> (known after apply) ~ http_tokens = "optional" -> (known after apply) } + network_interface { + delete_on_termination = (known after apply) + device_index = (known after apply) + network_interface_id = (known after apply) } ~ root_block_device { ~ delete_on_termination = true -> (known after apply) ~ device_name = "/dev/xvda" -> (known after apply) ~ encrypted = false -> (known after apply) ~ iops = 100 -> (known after apply) + kms_key_id = (known after apply) ~ tags = {} -> (known after apply) ~ throughput = 0 -> (known after apply) ~ volume_id = "vol-04449142f8adaf362" -> (known after apply) ~ volume_size = 8 -> (known after apply) ~ volume_type = "gp2" -> (known after apply) } } # module.some_ec2_service.aws_security_group.this will be created + resource "aws_security_group" "this" { + arn = (known after apply) + description = "Managed by Terraform" + egress = (known after apply) + id = (known after apply) + ingress = (known after apply) + name = "allow-nothing" + name_prefix = (known after apply) + owner_id = (known after apply) + revoke_rules_on_delete = false + tags = { + "Name" = "allow-nothing" } + tags_all = { + "Environment" = "stage" + "ManagedBy" = "terraform" + "Name" = "allow-nothing" + "Repo" = "https://github.com/walkerab/terraform-plus-github-actions" } + vpc_id = (known after apply) } Plan: 2 to add, 0 to change, 2 to destroy.
```